<?
$MESS["FORUM_PPE_PPM"] = "Балів за повідомлення";
$MESS["FPPN_TAB_POINT"] = "Бали за повідомлення";
$MESS["FPPN_TAB_POINT_DESCR"] = "Бали за повідомлення";
$MESS["FPPN_DELETE_POINT_CONFIRM"] = "Ви впевнені, що хочете видалити цей запис?";
$MESS["FPPN_NEW_POINT"] = "Додати новий запис";
$MESS["FORUM_PPE_TITLE_ADD"] = "Додавання нового запису";
$MESS["FORUM_PPE_TITLE_UPD"] = "Змінення запису ##ID#";
$MESS["FORUM_PPE_MIN_MES"] = "Необхідно повідомлень";
$MESS["FORUM_PPE_ERROR_ADD"] = "Помилка додавання нового запису";
$MESS["FORUM_PPE_EDDOR_UPDATE"] = "Помилка змінення параметрів запису";
$MESS["FORUM_PPE_NOTES"] = "Перерахунок балів користувачів при зміненні запису автоматично <b>не</b> проводиться. Перерахунок балів кожного користувача відбудеться при написанні ним чергового повідомлення, при голосуванні за нього і т.п.";
$MESS["FPPN_2FLIST"] = "Список записів";
$MESS["FPPN_DELETE_POINT"] = "Видалити запис";
?>