<?php
$MESS["CATALOG_STATE_ERR_PRODUCT_IN_SECTION_LIMIT"] = "Після перенесення розділу ви перевищите обмеження на кількість товарів, які використовуються в лендінгах. Таких товарів стане #COUNT# (ліміт - #LIMIT#).";
$MESS["CATALOG_STATE_ERR_PRODUCT_LIMIT"] = "Перевищено обмеження кількості товарів, які використовуються в лендінгах. В каталозі знайдено #COUNT# таких товарів (ліміт - #LIMIT#).";
$MESS["CATALOG_STATE_ERR_PRODUCT_LIMIT_1"] = "Товари поточного розділу виводяться на цільовій сторінці. Ви вже опублікували максимально дозволену на вашому тарифі кількість товарів. Створіть товар в іншому розділі, не пов'язаному з цільовими сторінками, або зніміть з публікації якийсь товар у поточному розділі. У каталозі знайдено таких товарів: #COUNT# (ліміт — #LIMIT#).";
