<?
$MESS["BUY_SUP_AMOUNT"] = "Разом: #AMOUNT#";
$MESS["BUY_SUP_BUTTON"] = "Відправити заявку";
$MESS["BUY_SUP_BUY"] = "Купити";
$MESS["BUY_SUP_BUY_1"] = "Придбання подовження дозволить вам протягом року:";
$MESS["BUY_SUP_BUY_1_1"] = "Закінчення терміну дії стандартної ліцензії призводить до накладення обмежень на систему оновлень, на деякі функціональні можливості продукту та технічну підтримку.<br /><br />

Після закінчення терміну дії стандартної ліцензії ви не зможете встановлювати оновлення платформи, отримувати нові версії продукту та встановлювати застосунки з каталогу рішень Маркетплейс, а також продовження для них.<br />
Одночасно з цим припиняється робота наших хмарних сервісів, наприклад «CDN» або «Хмарний бекап».<br /><br />

<b>Для вас стає недоступною технічна підтримка.</b><br /><br />

Для того щоб продовжити користуватися перерахованими вище можливостями, необхідно придбати продовження.<br /><br />
Звертаємо вашу увагу, що ви можете продовжувати використання продукту на умовах обмеженої ліцензії без обмеження за часом.<br /><br />
З подробицями можна ознайомитися в «<a href=\"#LINK#\" target=\"_blank\">Ліцензійній угоді</a>».<br /><br />";
$MESS["BUY_SUP_BUY_2"] = "<ul>
   <li style=\"padding-bottom: 10px;\">Отримувати доступ до останніх оновлень платформи «Бітрікс». Два рази на рік ми випускаємо нові версії нашого програмного продукту, розширюючи і удосконалюючи його функціонал. Більше того, між великими випусками нових версій ми пропонуємо нашим клієнтам ряд поточних невеликих поліпшень продукту.</li>
   <li style=\"padding-bottom: 10px;\">Мати пріоритетну технічну підтримку. Технічна підтримка власникам активних ліцензійних ключів (тих, для яких куплено продовження) надається в 3 рази швидше, ніж іншим користувачам.</li>
   <li style=\"padding-bottom: 10px;\">Зберігати резервні копії вашого сайту в хмарі «Бітрікс».</li>
   <li style=\"padding-bottom: 10px;\">Використовувати технології CDN і «Композитний сайт», що дозволяють прискорити завантаження вашого сайту.</li>
   <li style=\"padding-bottom: 10px;\">Використовувати сервіс «Інспектор сайтів» для цілодобового моніторингу працездатності вашого сайту.</li>
   <li style=\"padding-bottom: 10px;\">Завантажувати готові рішення та модулі з «Маркетплейсу».</li>
  </ul>
  Якщо ж ви вирішите не продовжувати ліцензію, то ваш сайт буде продовжувати працювати, але перераховані вище переваги стануть для нього недоступні.<br /><br />
  Ви зможете надалі використовувати ту версію продукту, яка у вас буде на момент завершення періоду отримання оновлень (закінчення ліцензії).<br /><br />";
$MESS["BUY_SUP_BUY_2_CP"] = "<ul>
<li style=\"padding-bottom: 10px;\">Отримувати доступ до останніх оновлень платформи «Бітрікс». Два рази на рік ми випускаємо нові версії нашого програмного продукту, розширюючи і удосконалюючи його функціонал. Більш того, між великими випусками нових версій ми пропонуємо нашим клієнтам ряд поточних поліпшень продукту та оновлення системи безпеки.</li>
<li style=\"padding-bottom: 10px;\">Мати пріоритетну технічну підтримку. Технічна підтримка власникам активних ліцензійних ключів (тих, для яких куплено продовження) надається в 3 рази швидше (менше 6 робочих годин), ніж іншим користувачам.</li>
<li style=\"padding-bottom: 10px;\">Зберігати резервні копії вашого порталу в хмарі «Бітрікс».</li>
<li style=\"padding-bottom: 10px;\">Отримувати готові рішення і модулі з «Маркетплейс».</li>
</ul>
Якщо ж ви вирішите не продовжувати ліцензію, ваш портал буде працювати, але перераховані вище переваги стануть для нього недоступні.<br /><br />
Ви зможете в подальшому використовувати ту версію продукту, яка у вас буде на момент завершення періоду отримання оновлень (закінчення Стандартної ліцензії).<br /><br />
У разі виникнення питань щодо продовження ліцензії, прохання писати нам на <a href=\"mailto:sales@bitrix24.ua\">sales@bitrix24.ua</a>.<br /><br />
";
$MESS["BUY_SUP_BUY_3"] = "<b>Переваги покупки через партнера:</b><br />
<ul>
<li style=\"padding-bottom: 10px;\">надання ліцензійного договору і закриваючого акту;</li>
<li style=\"padding-bottom: 10px;\">допомога в установці оновлень;</li>
<li style=\"padding-bottom: 10px;\">надання супутніх послуг та консультацій по продукту;</li>
<li style=\"padding-bottom: 10px;\">індивідуальний підхід до клієнта.</li>
</ul>";
$MESS["BUY_SUP_BUY_EULA_LINK"] = "https://www.bitrix.ua/download/files/manuals/ua/eula_bus_ua.htm";
$MESS["BUY_SUP_BUY_EULA_LINK_CP"] = "https://www.bitrix.ua/download/files/manuals/ua/eula_b24_ua.htm";
$MESS["BUY_SUP_BUY_SELF"] = "Придбати подовження самостійно";
$MESS["BUY_SUP_CONTACT"] = "Вкажіть, як з вами зв'язатися";
$MESS["BUY_SUP_CONTACT_OK"] = "Заявка партнеру відправлена! Протягом 2-х днів з вами зв'яжеться співробітник компанії-партнера.";
$MESS["BUY_SUP_CONTACT_OK2"] = "Заявка партнеру відправлена! З вами зв'яжеться співробітник компанії-партнера.";
$MESS["BUY_SUP_EMAIL"] = "E-mail:";
$MESS["BUY_SUP_NAME"] = "Ваше ім'я:";
$MESS["BUY_SUP_PARTNER"] = "Ваш партнер:";
$MESS["BUY_SUP_PARTNER_TITLE"] = "Рекомендуємо вам придбати продовження ліцензії у партнера";
$MESS["BUY_SUP_PHONE"] = "Телефон:";
$MESS["BUY_SUP_PREQUEST"] = "Після надсилання заявки протягом 2-х днів з вами зв'яжеться співробітник компанії-партнера, надасть договір і рахунок на оплату, або запропонує інший, більш зручний для вас спосіб оплати.";
$MESS["BUY_SUP_PREQUEST1"] = "Після того як заявка буде відправлена, з вами зв'яжеться співробітник компанії-партнера, надасть договір і рахунок на оплату, або запропонує інший, більш зручний для вас спосіб оплати.";
$MESS["BUY_SUP_SHT"] = "шт.";
$MESS["BUY_SUP_TITLE"] = "Варіанти подовження ліцензії";
$MESS["BUY_SUP_TOBUY"] = "Вам потрібно купити:";
$MESS["BUY_SUP_YEMAIL"] = "Ваш E-mail:";
$MESS["BUY_SUP_YPHONE"] = "Ваш телефон:";
?>