<?
$MESS["MAIN_OPTION_CLEAR_CACHE_LANDING"] = "Сайти24";
$MESS["cache_admin_note4"] = "<p>Механізм HTML-кешування найкраще включити на який-небудь  розділ, що рідко змінюється,  з регулярним відвідуванням анонімних відвідувачів, оскільки при увімкненому HTML-кешуванні відбуваються наступні процеси:</p>
<ul style=\"font-size:100%\">
<li> механізмом HTML-кешу обробляються лише сторінки, не вказані в масці винятку і зазначені в масці увімкнення;</li>
<li>якщо на такі сторінки заходить не авторизований користувач, то виконується перевірка існування файлу кешу і якщо такий знайдено, то видається сторінка з кешу, не задіюючи ніякі модулі продукту; наприклад, не буде працювати модуль статистики (не зарахуються хіти користувача), модуль реклами, головний та інші модулі;</li>
<li> при цьому, якщо на момент включення кешу був встановлений модуль компресії, то сторінка буде віддаватися в стислому вигляді;</li>
<li> якщо сторінка в кеші не знайдена, то код виконується в звичайному режимі; коли сторінка повністю сформована, її копія зберігається в HTML-кеш;</li>
</ul>
<p>Oчищення кеша:</p>
<ul style=\"font-size:100%\">
<li> якщо обсяг, що зберігається, призводить до перевищення дискової квоти кешу, то кеш повністю очищується;</li>
<li> також повне очищення кешу відбувається при будь-якому зміненні даних в адміністративній частині системи;</li>
<li> якщо в публічній частині сайту відбувається POST даних (наприклад, додавання коментаря або голосування), то скидається відповідна частина кешу;</li>
</ul>

<p> Необхідно відзначити, що якщо неавторизований користувач перейде в незакешовану частину сайту, то для нього почнеться сесія і для цього відвідувача HTML-кеш працювати більше не буде.</p>

<p> З усього вище сказаного випливає, що:</p>
<ul style=\"font-size:100%\">
<li> не ведеться облік статистики;</li>
<li> модуль реклами буде працювати тільки в момент створення кешу (це не відноситься до зовнішньої динамічної рекламі (Begun та ін.));</li>
<li> наприклад, для неавторизованих користувачів результати порівняння товарів не будуть збережені (оскільки його дані зберігаються в сесії, якої «ні»);</li>
<li> необхідно обов'язково задати дискову квоту щоб уникнути DDoS-атаки за дисковим простором;</li>
<li> після увімкнення механізму HTML-кешування необхідно перевірити весь функціонал розділу, до якого застосовано кеш (наприклад, може не спрацювати публікація коментарів з старими шаблонами блогів);</li>
</ul>";
$MESS["cache_admin_note1"] = "<table width=\"100%\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\">
  <tr>
    <td valign=\"top\">Використання режиму «Автокешування» дозволяє прискорити роботу вашого сайту в кілька разів!</td>
  </tr>
  <tr>
    <td valign=\"top\"><br />
    Зверніть увагу: при використанні режима «Автокешування», оновлення інформації, що виводиться компонентами, відбувається відповідно до параметрів окремих компонентів. </td>
  </tr>
  <tr>
    <td valign=\"top\"><br />
    Для того, щоб оновити вміст закешованих об’єктів на сторінці, ви можете: </td>
  </tr>
</table>
<table width=\"100%\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\">
  <tr>
    <td align=\"center\" valign=\"top\">&nbsp;</td>
  </tr>
  <tr>
    <td valign=\"top\">1. Перейти на потрібну сторінку та оновити її вміст, використовуючи спеціальну кнопку в адміністративній панелі для очищення закешованої інформації.<br />
    <img src=\"/bitrix/images/main/page_cache.png\" width=\"269\" height=\"131\" vspace=\"5\" /></td>
  </tr>
  <tr>
    <td align=\"center\" valign=\"top\">&nbsp;</td>
  </tr>
  <tr>
    <td valign=\"top\">2. У режимі Редагування сайту використовувати кнопки для очищення кешу в панелі окремих компонентів.<br />
    <img src=\"/bitrix/images/main/comp_cache.png\" width=\"719\" height=\"162\" vspace=\"5\" /></td>
  </tr>
  <tr>
    <td valign=\"top\">&nbsp;</td>
  </tr>
  <tr>

    <td valign=\"top\">3. Необхідноо перейти до налаштувань вибраних компонентів та перевести їх у режим роботи без кешування. <br>
    <img src=\"/bitrix/images/main/spisok.gif\" width=\"682\" height=\"105\" vspace=\"5\" /></td>
    </tr>
</table>
<br />
<p> Примітка: При увімкненні режиму автокешірованія компонентів, компоненти з налаштуванням кешування <i>«Авто»</i> буде переведено у режим роботи з кешуванням.<br />
<br />
Компоненты с налаштуванням кешування <i>«Кешувати»</i> та часом кешування більше нуля завжди працюють в режимі кешування.<br />
<br />
Компоненты с налаштуванням кешування <i>«Не кешувати»</i> або часом кешування рівним нулю завжди працюють без кешування.</p>";
$MESS["MAIN_OPTION_CACHE_OFF"] = "Автокешування компонентів вимкнено";
$MESS["MAIN_OPTION_CACHE_ON"] = "Автокешування компонентів увімкнено";
$MESS["MAIN_OPTION_CLEAR_CACHE_MANAGED"] = "Весь керований";
$MESS["main_cache_managed_const"] = "Визначена константа BX_COMP_MANAGED_CACHE — керований кеш завжди увімкнений.";
$MESS["MAIN_OPTION_CACHE_BUTTON_OFF"] = "Вимкнути автокешування";
$MESS["main_cache_managed_turn_off"] = "Вимкнути керований кеш (не рекомендується)";
$MESS["MAIN_OPTION_CLEAR_CACHE_ALL"] = "Всі";
$MESS["MAIN_OPTION_CLEAR_CACHE_STATIC"] = "Всі сторінки HTML-кеша";
$MESS["main_cache_managed"] = "Керований кеш";
$MESS["main_cache_managed_off"] = "Керований кеш компонентів вимкнений (не рекомендується).";
$MESS["main_cache_managed_on"] = "Керований кеш компонентів увімкнений.";
$MESS["MAIN_TAB_4"] = "Кешування компонентів";
$MESS["MAIN_OPTION_CLEAR_CACHE_MENU"] = "Меню";
$MESS["main_cache_managed_sett"] = "Налаштування керованого кешування";
$MESS["main_cache_managed_saved"] = "Налаштування керованого кешування збережені.";
$MESS["MCACHE_TITLE"] = "Налаштування кешування";
$MESS["MAIN_OPTION_PUBL"] = "Налаштування кешування компонентів";
$MESS["MAIN_OPTION_CLEAR_CACHE_CLEAR"] = "Очистити";
$MESS["MAIN_TAB_3"] = "Очищення файлів кеша";
$MESS["MAIN_OPTION_CLEAR_CACHE"] = "Очищення файлів кеша";
$MESS["cache_admin_note2"] = "Після видалення файлів кешу дані,  що виводяться, будуть оновлені до актуального стану.
Нові файли кешу будуть створюватися поступово по мірі звернень до сторінок з закешованими областями.";
$MESS["main_cache_managed_note"] = "Технологія керованого кешування <b>Сache Dependencies</b> автоматично оновлює кеш компонентів при зміненні даних. 
Якщо кероване кешування увімкнено, вам не знадобиться вручну оновлювати кеш компонентів при зміненні новин або товарів, зміни одразу стануть видні відвідувачам сайту.
<br><br>Дізнатися більше про технології <a href=\"http://dev.1c-bitrix.ru/community/blogs/rsv/2074.php\">Сache Dependencies</a> на нашому сайті.
<br><br>
<span style=\"color:grey\"> Зауваження: не всі компоненти можуть підтримувати кероване кешування.</span>
";
$MESS["MAIN_OPTION_CACHE_ERROR"] = "Тип автокешування компонентів вже має дане значення";
$MESS["MAIN_OPTION_CACHE_SUCCESS"] = "Тип автокешування компонентів успішно перемкнуто";
$MESS["MAIN_OPTION_CLEAR_CACHE_OLD"] = "Тільки застарілі";
$MESS["MAIN_OPTION_CACHE_BUTTON_ON"] = "Увімкнути автокешування";
$MESS["main_cache_managed_turn_on"] = "Увімкнути керований кеш";
$MESS["MAIN_OPTION_CACHE_OK"] = "Файли кешу очищені";
$MESS["cache_admin_note5"] = "У даній редакції HTML кеш завжди увімкнений.";
$MESS["main_cache_wrong_cache_type"] = "Невірний тип кешування.";
$MESS["main_cache_wrong_cache_path"] = "Невірний шлях до файлу кеша.";
$MESS["main_cache_in_progress"] = "Йде видалення файлів кеша.";
$MESS["main_cache_finished"] = "Видалення файлів кеша завершено.";
$MESS["main_cache_files_scanned_count"] = "Опрацьовано: #value#";
$MESS["main_cache_files_scanned_size"] = "Розмір оброблених файлів: #value#";
$MESS["main_cache_files_deleted_count"] = "Вилучено: #value#";
$MESS["main_cache_files_deleted_size"] = "Розмір віддалених файлів: #value#";
$MESS["main_cache_files_delete_errors"] = "Помилок видалення: #value#";
$MESS["main_cache_files_last_path"] = "Поточний каталог: #value#";
$MESS["main_cache_files_start"] = "Почати";
$MESS["main_cache_files_continue"] = "Продовжити";
$MESS["main_cache_files_stop"] = "Зупинити";
?>