<?
$MESS["CL_TAB_TEST"] = "Тест";
$MESS["CL_TITLE_CHECKLIST"] = "Монітор якості";
$MESS["CL_TAB_DESC"] = "Опис";
$MESS["CL_TAB_RESULT"] = "Результат";
$MESS["CL_TEST_NAME"] = "Назва";
$MESS["CL_TEST_CODE"] = "Код тесту";
$MESS["CL_TEST_LINKS"] = "Посилання";
$MESS["CL_NOW_TO_TEST_IT"] = "Як тестувати";
$MESS["CL_NOW_AUTOTEST_WORK"] = "Як працює автотестування";
$MESS["CL_TEST_STATUS"] = "Статус тесту";
$MESS["CL_W_STATUS"] = "Очікує";
$MESS["CL_A_STATUS"] = "Пройдено успішно";
$MESS["CL_F_STATUS"] = "Не пройдено";
$MESS["CL_S_STATUS"] = "Пропущений";
$MESS["CL_STATUS_COMMENT"] = "Коментар";
$MESS["CL_SHOW_COMMENTS"] = "Показати коментарі";
$MESS["CL_HIDE_COMMENTS"] = "Сховати коментарі";
$MESS["CL_BEGIN_PROJECT_AUTOTEST"] = "Запустити автотестування";
$MESS["CL_BEGIN_PROJECT_AUTOTEST_DELAY"] = "Відкласти";
$MESS["CL_TESTER"] = "Тестувальник";
$MESS["CL_VENDOR"] = "Розробник";
$MESS["CL_TEST_TOTAL"] = "Всього тестів";
$MESS["CL_TEST_CHECKED"] = "Пройдено успішно";
$MESS["CL_TEST_CHECKED_R"] = "Залишилося обов'язкових";
$MESS["CL_TEST_FAILED"] = "Не пройдено";
$MESS["CL_TEST_WAITING"] = "В очікуванні";
$MESS["CL_TEST_SKIP_REQUIRE"] = "Пропущено обов'язкових";
$MESS["CL_TEST_REQUIRE"] = "Обов'язкових";
$MESS["CL_TEST_IS_REQUIRE"] = "обов'язковий";
$MESS["CL_CHECK_PROGRESS"] = "Виконано тестів";
$MESS["CL_TEST_PROGRESS"] = "#check# з #total#";
$MESS["CL_BEGIN_AUTOTEST"] = "Запустити автотест";
$MESS["CL_BEGIN"] = "Здати проєкт";
$MESS["CL_END_TEST"] = "Завершити ...";
$MESS["CL_END_TEST_PROCCESS"] = "Завершення ...";
$MESS["CL_SAVE_REPORT"] = "Зберегти звіт";
$MESS["CL_PASS_TEST"] = "запустити автотест";
$MESS["CL_TEST_RESULT"] = "Результат тестування";
$MESS["CL_TEST_CHECKED_COUNT"] = "тестів пройдено успішно";
$MESS["CL_TEST_CHECKED_COUNT_FROM"] = "з";
$MESS["CL_REPORT_DATE"] = "Дата";
$MESS["CL_REPORT_CLIENT_NAME"] = "Контактна особа (ПІБ)";
$MESS["CL_REPORT_CLIENT_POST"] = "Посада співробітника";
$MESS["CL_REPORT_EMAIL"] = "Контактний e-mail";
$MESS["CL_REPORT_COMMENT"] = "Коментар";
$MESS["CL_REPORT_COMPANY_NAME"] = "Компанія";
$MESS["CL_REPORT_PHONE"] = "Контактний телефон";
$MESS["CL_REPORT_PHONE_ADD"] = "дод.";
$MESS["CL_REPORT_FIO_TESTER"] = "П.І.Б.";
$MESS["CL_ADD_COMMENT"] = "Додати коментар ...";
$MESS["CL_REPORT_INVITE"] = "Запрошуємо вас взяти участь у програмі монітора якості. Заповніть форму нижче, щоб наші співробітники могли зв'язатися з клієнтом для проведення анкетування. Попередьте клієнта.";
$MESS["CL_REPORT_COMMENT_HELP"] = "Вкажіть у полі нижче додаткову інформацію, наприклад, в який час краще дзвонити клієнтові і т.п..";
$MESS["CL_SAVE_SEND_REPORT"] = "Здати проєкт в «Бітрікс24»";
$MESS["CL_SAVE_SEND_REPORT_CUT"] = "Здати в «Бітрікс24»";
$MESS["CL_SAVE_SEND_REPORT_HINT"] = "При здачі проєкту на контроль якості в компанію «Бітрікс24» передається тільки інформація про результати проходження тестів по Монітора якості та контактні дані з боку власника проєкту (для зв'язку співробітниками «Бітрікс24»). Ніякі інші дані про проєкт не передаються якщо вони окремо (вручну) не вказані в коментарях до тестів.";
$MESS["CL_SHOW_HIDDEN"] = "Показувати приховані";
$MESS["CL_REPORT_ARCHIVE"] = "Архів звітів";
$MESS["CL_REPORT_TABLE_TESTER"] = "Хто проводив";
$MESS["CL_REPORT_TABLE_TOTAL"] = "Всього тестів";
$MESS["CL_REPORT_TABLE_CHECKED"] = "Пройдено успішно";
$MESS["CL_REPORT_TABLE_FAILED"] = "Не пройдено";
$MESS["CL_REPORT_TABLE_DETAIL"] = "подробиці";
$MESS["CL_AUTOTEST_DONE"] = "Автотест завершено";
$MESS["CL_TEST"] = "Тест";
$MESS["CL_DESC"] = "Опис";
$MESS["CL_BEGIN_PROGECT_TEST"] = "Перейти до перегляду дерева тестів";
$MESS["CL_EMPTY_DESC"] = "Опис відсутній";
$MESS["CL_REPORT_NOT_FOUND"] = "звіт не знайдено";
$MESS["CL_REPORT_INFO"] = "Інформація по звіту";
$MESS["CL_BACK_TO_CHECKLIST"] = "Повернутися до попередньої сторінки";
$MESS["CL_MORE_DETAILS"] = "Докладний звіт";
$MESS["CL_MORE_DETAILS_INF"] = "Детальна інформація про результат автотестування";
$MESS["CL_REQUIRE_FIELDS"] = "Всі поля, окрім коментаря і додаткового номера, обов'язкові для заповнення!";
$MESS["CL_REQUIRE_FIELDS2"] = "Всі поля обов'язкові для заповнення!";
$MESS["CL_AUTOTEST_RESULT"] = "Результати автотестування";
$MESS["CL_SAVE_COMMENTS"] = "Зберегти коментар";
$MESS["CL_AUTOTEST_START"] = "Запустити автотест";
$MESS["CL_PERCENT_LIVE"] = "Завершено на";
$MESS["CL_RESULT_TEST"] = "Результат автотеста";
$MESS["CL_NEXT_TEST"] = "Наступний";
$MESS["CL_PREV_TEST"] = "Попередній";
$MESS["CL_FROM"] = "з";
$MESS["CL_CLOSE"] = "Закрити";
$MESS["CL_DONE"] = "Готово";
$MESS["CL_HIDE_REPORT"] = "Сховати проєкт";
$MESS["CL_SHOW_REPORT"] = "Показувати проєкт";
$MESS["CL_REFRESH_REPORT_STATUSES"] = "Оновити статуси проєктів";
$MESS["CL_NO_COMMENT"] = "немає коментарів";
$MESS["CL_SAVE_SUCCESS"] = "Статус тесту та коментарі збережені";
$MESS["CL_NEED_TO_STOP"] = "Для зміни статус потрібно зупинити автотестування";
$MESS["CL_CANT_CLOSE_PROJECT_PASSED_REQUIRE"] = "Зараз пройдено обов'язкових:";
$MESS["CL_CANT_CLOSE_PROJECT_FAILED"] = "Тестів у статусі \"Не пройдено\":";
$MESS["CL_SENDING_QC_REPORT"] = "Відправка результатів Монітора Якості ...";
$MESS["CL_REPORT_SENDED"] = "Звіт направлений в «Бітрікс24»";
$MESS["CL_CANT_CLOSE_PROJECT"] = "Ви не можете закрити проєкт. Всі <b>обов'язкові</b> тести повинні бути в статусі \"Проаущений\" або в \"Пройдений\". Також в дереві не повинно бути не пройдених тестів.";
$MESS["CL_EMPTY_COMMENT"] = "Для статусу 'Відсутній' обов'язково потрібно коментар!";
$MESS["CL_MANUAL"] = "Для здачі проєкту вам потрібно пройти тести різного призначення - якість розробки, настройки продукту і дотримання рекомендацій, специфічних для платформи Бітрікс. Для наочності тести розбиті по категоріях. Самі тести можуть ділитися на два типи: <b>обов'язкові</b> і <b>необов'язкові</b>. Для здачі проєкту досить виконати тільки обов'язкові тести. Проходження необов'язкових тестів додасть бали Вашого проєкту. У деяких тестів є автоматична перевірка. Для початку здачі проєкту запустите автотестування:";
$MESS["CL_MANUAL2"] = "<p>Партнерська програма Моніторингу якості проєктів включає два етапи: пройдений Монітор якості проєкту і анкетування його власника. Перший етап (Монітор якості) пройдений.</P>
<p>
<b>Другий етап здачі проєкту в \"Бітрікс24\". Анкетування власника проєкту.</b><br>
Будь ласка, вкажіть контактні дані власника.<br>
Ми зв'яжемося з ним і задамо всього 10 невеликих питань, що стосуються якості менеджменту студії-розробника, якості розробленого проєкту і зручність роботи з програмним продуктом \"Бітрікс\".
</p>
<p><b>Обов'язково попередьте про наш дзвінок!</b></p>";
$MESS["CL_MANUAL_MINI"] = "Тепер Вам потрібно пройти залишилися обов'язкові тести. Це можна зробити з дерева тестів, простим кліком на назві тесту. Обов'язкові тести позначені чорним кольором. Автоматичні обов'язкові тести будуть позначені червоним - Вам потрібно знайти і виправити причину невиконання умов тесту. Інформація для цього є в описі тесту. Після усунення неполадок, автоматичні тести можна запустити заново.";
$MESS["CL_MANUAL_MINI_2"] = "Цих результатів достатньо. Для здачі проєкту Вам потрібно зберегти звіт про тестування.";
$MESS["CL_MANUAL_TEST"] = "Чекліст контролю якості впровадження містить рекомендації експертів компанії для виконання якісної інтеграції веб-проєкту, починаючи з фази налаштування шаблонів дизайну і закінчуючи навантажувальним тестуванням і організацією аудиту безпеки.<br>
Рекомендації засновані на досвіді впроваджень і експлуатації веб-рішень різного рівня складності на платформі Bitrix Framework під високими навантаженнями. Виконання рекомендацій підвищить продуктивність, безпека і керованість веб-проєкту, знизить технологічні ризики і вартість подальшої підтримки і розвитку.
<br>
Рекомендації представлені у вигляді обов'язкових та необов'язкових тестів. Обов'язкові тести - критичні і повинні бути пройдені. Необов'язкові тести - рекомендовані до виконання. Деякі тести - автоматизовані.
<br>
Проєкт готовий до здачі, якщо всі розділи чекліста виділені зеленим кольором.
<br>
Рекомендований порядок здачі:
<br><br>
1) Розробник запускає автоматизоване тестування. Система проводить автоматичну перевірку, позначаючи кожен автоматизований текст <font color=\"green\"> \"пройдено успішно\"</font> або <font color=\"red\">\"не пройдений\"</font>.
<br><br>
2) Розробник перевіряє кожен не пройдений автоматизований тест, усуває недоліки і перезапускає АВТОТЕСТ для повторної перевірки. Можливий річний переклад тесту в статус \"пропущений\".
<br><br>
3) Розробник перевіряє не автоматизовані тести і переводить його в статус <font color=\"green\">\"пройдено успішно\"</font> або \"пропущений\".<br><br>

4) Після того, як обов'язкові тести успішно пройдені, розробник вводить інформацію про себе / своєї компанії у відповідний розділ чекліста.<br><br>

5) Розробник пред'являє Клієнту проєкт. Клієнт переконується, що всі обов'язкові тести перебувають у статусі <font color=\"green\">\"пройдено успішно\"</font>, і немає тестів у статусі <font color=\"red\">\"не пройдений\"</font>.<br><br>

6) Розробник здає проєкт, який успішно пройшов комплексне тестування і переводить його в архів.<br><br>

Рекомендується здавати по чеклісту контролю якості впровадження також всі наступні доопрацювання веб-проєкту. Це дозволить забезпечити достатній рівень якості інтеграції при розвитку і зміні функціоналу веб-проєкту.";
$MESS["CL_FORM_ABOUT_CLIENT_TITLE"] = "Контактні дані для зв'язку в власником проєкту";
$MESS["CL_REPORT_CITY"] = "Місто";
$MESS["CL_REPORT_WARNED"] = "Підтверджую";
$MESS["CL_REPORT_WARNED2"] = ", що клієнт попереджений про дзвінок співробітника Бітрікс24";
$MESS["CL_REPORT_CALL_TIME"] = "Час для дзвінка";
$MESS["CL_REPORT_CALL_TIME_HINT"] = "вкажіть зручний час для дзвінка співробітника Бітрікс24 вашому клієнтові з 09-18 за київським часом";
$MESS["CL_REPORT_SITES"] = "Сайти";
$MESS["CL_ADD_SITES_FIELDS"] = "Додати ще";
$MESS["CL_REQUIRE_SITES"] = "Зазначені Вами домени повинні бути вказані у налаштуваннях сайтів (поле \"Доменне ім'я\").";
$MESS["CL_REPORT_OLD"] = "Дані звіту застаріли, будь ласка, пройдіть тестування ще раз.";
?>