<?
$MESS["SMILE_IMPORT_TITLE"] = "Імпорт смайлів";
$MESS["ERROR_IMPORT_SMILE"] = "Помилка імпорту смайлів";
$MESS["ERROR_BAD_SESSID"] = "Ваша сесія скінчилася. Будь-ласка, повторіть дію ще раз.";
$MESS["ERROR_COPY_FILE"] = "Помилка завантаження архіву. Можливо недостатньо прав на запис.";
$MESS["ERROR_EXISTS_FILE"] = "Помилка завантаження архіву. Будь ласка, повторіть дію ще раз.";
$MESS["SMILE_SET_ID"] = "Набір";
$MESS["SMILE_FILE"] = "Архів";
$MESS["SMILE_FILE_NOTE"] = "Формат архіву: zip, без стиснення";
$MESS["SMILE_TAB_SMILE"] = "Параметри";
$MESS["SMILE_TAB_SMILE_DESCR"] = "Параметри імпорту";
$MESS["IM_IMPORT_COMPLETE"] = "Імпорт завершений.";
$MESS["IM_IMPORT_TOTAL"] = "Успішно імпортовано смайлів: #COUNT#";
$MESS["IM_IMPORT_HELP_1"] = "Архів може містити службові файли опису та локалізацій, приклад архіву можна скачати #LINK_START#тут#LINK_END#.";
$MESS["IM_IMPORT_HELP_2"] = "Якщо службові файли не  будуть знайдені, то імпорт буде проведений за списком файлів з використанням міток у назві файлу (\"smile_\" - смайл, \"icon_\" - іконка, \"hr\" - висока роздільна здатність).";
$MESS["IM_IMPORT_HELP_3"] = "Наприклад при імпорті в категорію з кодом \"test\", файл <b>smile_green_hr.png</b> буде інтерпретований як \"Смайл у високій роздільній здатності\", а код вставки в редактор буде <b>: test/green:</b>";
$MESS["IM_IMPORT_HELP_4"] = "<b>Увага! Рекомендується створити і використовувати свій набір або свою галерею. При установці чергового оновлення системи внесені в стандартний набір зміни можуть бути видалені. </b>";
?>