<?php
$MESS["MAIN_SRV_GEOIP_MM_DESCRIPTION"] = "Заснована в 2002 році, компанія MaxMind – провідний постачальник в галузі IP-аналітики і засобів виявлення мережевої шахрайської діяльності.<br>
Сайт: <a href='https://www.maxmind.com'>https://www.maxmind.com</a><br>
Для роботи оброблювача необхідно отримати на сайті компанії ідентифікатор користувача і ліцензійний ключ";
$MESS["MAIN_SRV_GEOIP_MM_F_LICENSE_KEY"] = "Ліцензійний ключ";
$MESS["MAIN_SRV_GEOIP_MM_F_USER_ID"] = "Ідентифікатор користувача";
$MESS["MAIN_SRV_GEOIP_MM_SETT_EMPTY"] = "Не заповнені поля ідентифікатор користувача та/або ліцензійний ключ у налаштуваннях обробника";
$MESS["main_geoip_mm_service"] = "Використовуваний вебсервіс";
