<?
$MESS["IB1C_ERROR_CATEGORY"] = "Помилка завантаження групи";
$MESS["IB1C_ERROR_CATALOG"] = "Помилка завантаження каталогу";
$MESS["IB1C_ERROR_PROPERTY"] = "Помилка завантаження властивості";
$MESS["IB1C_ERROR_PRODUCT"] = "Помилка завантаження товару";
$MESS["IB1C_ERROR_IBTYPE"] = "Нікуди завантажувати каталог: немає жодного типу інформаційного блоку.";
$MESS["IB1C_ERROR_DATA_LOAD"] = "Дані для завантаження не передані.";
$MESS["IB1C_ERROR_WRONG_DATA"] = "Невалідний файл. Завантаження неможливе.";
?>