<?
$MESS["ERROR_EMPTY_BASE_PRICE"] = "Заповніть поле «Базова ціна»";
$MESS["ERROR_EMPTY_BASE_CURRENCY"] = "Заповніть поле «Валюта базової ціни»";
$MESS["ERROR_DELETE_PRICE"] = "Помилка видалення ціни";
$MESS["ERROR_UPDATING_PRICE"] = "Помилка збереження ціни";
$MESS["ERROR_ADDING_PRICE"] = "Помилка додавання ціни";
$MESS["C2IT_INTERNAL_ERROR"] = "Внутрішня помилка";
$MESS["C2IT_NO_BASE_TYPE"] = "Не знайдено базовий тип цін";
$MESS["C2IT_ERROR_BOUND_LEFT"] = "Помилка введення діапазону кількості: ліва межа \"#BORDER#\" повинна бути позитивною (не негативною для першого діапазону)";
$MESS["C2IT_ERROR_BOUND_RIGHT"] = "Помилка введення діапазону кількості: права межа \"#BORDER#\" повинна бути позитивною (не негативною для першого діапазону)";
$MESS["C2IT_ERROR_BOUND"] = "Помилка введення діапазону кількості: діапазон #DIAP# не є вірним";
$MESS["C2IT_ERROR_BOUND_PRICE"] = "Помилка введення ціни: не зазначена ціна для діапазону #DIAP#";
$MESS["C2IT_ERROR_PRICE"] = "Не вказана базова ціна";
$MESS["C2IT_ERROR_BOUND_CROSS"] = "Помилка введення діапазонів кількості: діапазони #DIAP1# та #DIAP2# перетинаються";
$MESS["C2IT_ERROR_BOUND_MISS"] = "Помилка введення діапазонів кількості: не вказані ціни для діапазону #DIAP1#";
$MESS["C2IT_ERROR_BOUND_MISS_TOP"] = "Помилка введення діапазонів кількості: не вказані ціни для кількості вище #BORDER#";
$MESS["C2IT_ERROR_PRPARAMS"] = "Помилка відновлення параметрів ціни з кодом #ID#";
$MESS["C2IT_ERROR_SAVEPRICE"] = "Помилка збереження ціни #PRICE#";
$MESS["C2IT_ERROR_NO_PRICE"] = "Відсутні ціни";
$MESS["C2IT_ERROR_SAVE_BARCODE"] = "Товар з таким штрих-кодом вже існує";
$MESS["C2IT_ERROR_SAVE_MULTIBARCODE"] = "Даний товар має кілька примірників з унікальними штрих-кодами.";
$MESS["C2IT_ERROR_USE_MULTIBARCODE"] = "Цей товар наявний на складах без унікальних штрихкодів. Перед увімкненням функціоналу унікальних штрихкодів необхідно списати даний товар з усіх складів.";
$MESS["C2IT_ERROR_PRODUCT_SAVE_UNKNOWN_ERROR"] = "При збереженні даних товару виникла невідома помилка. Зверніться до адміністратора сайту.";
$MESS["C2IT_ERROR_PRODUCT_SAVE_ERROR"] = "Помилка при збереженні даних товару: #ERROR#";
?>