<?php
$MESS["CAT_1CE_ELEMENTS_PER_STEP"] = "Кількість елементів вивантажуваних за один крок (0 — виконувати вивантаження за один крок)";
$MESS["CAT_1CE_GROUP_PERMISSIONS"] = "Дозволити вивантаження групам користувачів";
$MESS["CAT_1CE_IBLOCK_ID"] = "Інфоблок каталогу";
$MESS["CAT_1CE_IBLOCK_ID_EMPTY"] = "не вибрано";
$MESS["CAT_1CE_INTERVAL"] = "Інтервал одного кроку в секундах (0 — виконувати завантаження за один крок)";
$MESS["CAT_1CE_SETTINGS_SAVE_DENIED"] = "Для зміни параметрів цієї вкладки необхідно мати доступ до операції \"Зміна PHP-коду\" (edit_php) Головного модуля (main)";
$MESS["CAT_1CE_USE_ZIP"] = "Використовувати стиснення zip, якщо доступно";
$MESS["CAT_CATALOG_MODULE_IS_EMPTY"] = "Модуль \"Торгівельний каталог\" не встановлено.";
