<?
$MESS["CAT_EDIT_RECORD"] = "Редагування типу цін # #ID#";
$MESS["CAT_NEW_RECORD"] = "Новий тип цін";
$MESS["NAME"] = "Назва";
$MESS["CODE"] = "Код:";
$MESS["CAT_GROUPS"] = "Групи користувачів, що мають права на перегляд цього типу цін:";
$MESS["CAT_GROUPS_BUY"] = "Групи користувачів, що мають права на купівлю за цим типом цін:";
$MESS["BASE"] = "Базовий:";
$MESS["BASE_COMMENT"] = "Можливий тільки один базовий тип цін. Якщо ви встановите значення цього прапора, він автоматично зніметься з поточного базового типу.";
$MESS["BASE_COMMENT_Y"] = "Повинен бути хоча б один базовий тип цін. Якщо ви хочете змінити базовий тип, встановіть прапор на тому типі цін, який ви хочете зробити базовим.";
$MESS["BASE_YES"] = "Так";
$MESS["SORT2"] = "Сортування:";
$MESS["ERROR_UPDATING_TYPE"] = "Помилка змінення типу цін.";
$MESS["ERROR_ADDING_TYPE"] = "Помилка додавання типу цін.";
$MESS["CGEN_2FLIST"] = "Список типів цін";
$MESS["CGEN_NEW_GROUP"] = "Додати новий тип ціни";
$MESS["CGEN_DELETE_GROUP"] = "Видалити тип ціни";
$MESS["CGEN_DELETE_GROUP_CONFIRM"] = "Ви впевнені, що хочете видалити цей тип ціни?";
$MESS["CGEN_TAB_GROUP"] = "Тип ціни";
$MESS["CGEN_TAB_GROUP_DESCR"] = "Параметри типу ціни";
$MESS["BT_CAT_GROUP_EDIT_FIELDS_XML_ID"] = "Зовнішній код";
$MESS["CAT_FEATURE_NOT_ALLOW"] = "Даний функціонал не входить у Вашу редакцію продукту.";
?>