<?
$MESS["CC_BSAC_MESSAGE_E02"] = "Авторизація успішна.";
$MESS["CC_BSAC_MESSAGE_E05"] = "Вказано невірний код підтвердження реєстрації.";
$MESS["CC_BSAC_MESSAGE_E01"] = "Користувач не знайдений.";
$MESS["CC_BSAC_MESSAGE_E04"] = "Не зазначено код підтвердження реєстрації.";
$MESS["CC_BSAC_MESSAGE_E07"] = "Під час підтвердження реєстрації сталася помилка. Зверніться до адміністрації сервера.";
$MESS["CC_BSAC_MESSAGE_E03"] = "Реєстрація користувача вже підтверджена.";
$MESS["CC_BSAC_MESSAGE_E06"] = "Реєстрація користувача успішно підтверджена.";
?>