<?
$MESS["SEF_FOLDER_TIP"] = "Зазначається каталог, який буде відображатися в URL при переході на створювану сторінку.";
$MESS["SUCCESS_PAGE_TIP"] = "Можна вказати посилання на будь-яку сторінку на сайті, яка буде фінальною сторінкою процедури реєстрації, і користувач буде перенаправлений на неї у разі успішної реєстрації.";
$MESS["SHOW_FIELDS_TIP"] = "Налаштування слугує для вибору полів, які будуть виведені в формі реєстрації на додаток до стандартного набору (логіну, паролю, e-mail).";
$MESS["SEF_MODE_TIP"] = "Опція вмикає підтримку ЛЗУ.";
$MESS["USER_PROPERTY_TIP"] = "Позначте додаткові властивості, які необхідно відобразити в профілі користувача.";
$MESS["REQUIRED_FIELDS_TIP"] = "Поля, вибрані в попередньому пункті і зазначені тут, будуть обов'язковими для заповнення у формі.";
$MESS["SET_TITLE_TIP"] = "При зазначеній опції в якості заголовка сторінки буде встановлено «Реєстрація нового користувача».";
$MESS["USE_BACKURL_TIP"] = "При наявності в адресному рядку параметра <i>backurl</i> користувач буде перенаправлений за вказаним у цьому параметрі посиланні після заповнення форми реєстрації.";
$MESS["AUTH_TIP"] = "При наявності встановленої опції після реєстрації користувача він автоматично буде авторизований на сайті. У протилежному випадку після реєстрації користувачеві буде надана до заповнення форма авторизації.";
?>