<?
$MESS["CATALOG_INSTALL_NAME"] = "Торгівельний каталог";
$MESS["CATALOG_INSTALL_DESCRIPTION"] = "Модуль торгівельного каталогу дозволяє створювати комерційні каталоги товарів і послуг з цінами, націнками і імпортом/експортом даних. Модуль торгового каталога не може працювати без модуля інформаційних блоків.";
$MESS["CATALOG_INSTALL_TITLE"] = "Встановлення модуля торгівельного каталогу";
$MESS["CATALOG_INSTALL_PUBLIC_DIR"] = "Публічна папка";
$MESS["CATALOG_INSTALL_SETUP"] = "Встановити";
$MESS["CATALOG_INSTALL_COMPLETE_OK"] = "Встановлення завершено. Для додаткової допомоги зверніться в розділ допомоги.";
$MESS["CATALOG_INSTALL_COMPLETE_ERROR"] = "Встановлення завершено з помилками";
$MESS["CATALOG_INSTALL_ERROR"] = "Помилки при встановленні";
$MESS["CATALOG_INSTALL_BACK"] = "Повернутися в управління модулями";
$MESS["CATALOG_UNINSTALL_WARNING"] = "Увага! Модуль буде видалено з системи.";
$MESS["CATALOG_UNINSTALL_SAVEDATA"] = "Ви можете зберегти дані в таблицях бази даних, якщо встановите прапорець «Зберегти таблиці»";
$MESS["CATALOG_UNINSTALL_SAVECURRENCY"] = "Зберегти таблиці валют (використовуються спільно модулем торгівельного каталога і модулем продажів)";
$MESS["CATALOG_UNINSTALL_SAVETABLE"] = "Зберегти таблиці";
$MESS["CATALOG_UNINSTALL_DEL"] = "Видалити";
$MESS["CATALOG_UNINSTALL_ERROR"] = "Помилки при видаленні:";
$MESS["CATALOG_UNINSTALL_COMPLETE"] = "Видалення завершено.";
$MESS["CATALOG_INSTALL_PUBLIC_SETUP"] = "Встановити";
$MESS["CATALOG_UNINS_CURRENCY"] = "Для роботи модуля Каталог необхідний модуль Валют.<br />Встановіть спочатку модуль Валют.";
$MESS["CATALOG_UNINS_IBLOCK"] = "Для роботи модуля Каталог необхідний модуль Інфоблоків.<br />Встановіть спочатку  модуль Інфоблоки";
$MESS["CATALOG_INSTALL_DESCRIPTION2"] = "Модуль торгового каталога дозволяє створювати торгові каталоги товарів і послуг з цінами, націнками і імпортом / експортом даних.";
$MESS["CATALOG_PRODUCT_SUBSCRIBE_LIST_NAME"] = "Код підтвердження";
$MESS["CATALOG_PRODUCT_SUBSCRIBE_LIST_DESC"] = "#TOKEN# - Код підтвердження
#TOKEN_URL# - Посилання з кодом підтвердження
#LIST_SUBSCRIBES# - Список підписок";
$MESS["CATALOG_PRODUCT_SUBSCRIBE_LIST_SUBJECT"] = "#SITE_NAME#: Код підтверждения";
$MESS["CATALOG_PRODUCT_SUBSCRIBE_LIST_MESSAGE"] = "
Інформаційне повідомлення сайту #SITE_NAME#
------------------------------------------

Доброго дня,

Ви отримали це повідомлення, оскільки на вашу адресу було запитано код
підтвердження для доступу до підписок сайту #SERVER_NAME#.

Ваш код для підтвердження підписки: #TOKEN#

Для отримання доступу до підписок перейдіть за наступним посиланням:
#TOKEN_URL#

Ви також можете ввести код на сторінці:
#LIST_SUBSCRIBES#

---------------------------------------------------------------------
Лист містить інформацію для авторизації.
Використовуючи код підтвердження, ви зможете отримати доступ до списку підписок.
---------------------------------------------------------------------

Повідомлення згенеровано автоматично.
";
?>