<?
$MESS["SOL_BUTTON_TEST_TEXT_HINT"] = "Вибір нового рішення для установки.";
$MESS["SOL_BUTTON_DEL_TEXT"] = "Видалити цю кнопку";
$MESS["SOL_BUTTON_DEL_TITLE"] = "Видалити цю кнопку з панелі";
$MESS["SOL_BUTTON_TEST_MENU_HINT"] = "Натисніть на цю кнопку, щоб вибрати нове рішення для встановлення, видалення цієї кнопки з Панелі управління або для переходу на інший сайт.";
$MESS["SOL_BUTTON_GOTOSITE"] = "Перейти на сайт";
$MESS["SOL_BUTTON_TEST_TEXT"] = "Протестувати#BR#нове рішення";
$MESS["SOL_BUTTON_TEST_TITLE"] = "Створити новий сайт і запустити майстер встановлення нового рішення";
$MESS["SOL_BUTTON_CONFIRM_W2"] = "Увага! Після видалення кнопки ви зможете запустити майстер створення нового рішення в панелі управління, використовуючи сторінку з майстрами або формою додавання нового сайту. Видалити кнопку з панелі?";
?>