<?
$MESS["MF_SESS_EXP"] = "Ваша сесія закінчилася. Надішліть повідомлення повторно.";
$MESS["MF_REQ_MESSAGE"] = "Ви не написали повідомлення.";
$MESS["MF_REQ_EMAIL"] = "Вкажіть e-mail, на який бажаєте отримати відповідь.";
$MESS["MF_REQ_NAME"] = "Вкажіть Ваше ім'я.";
$MESS["MF_OK_MESSAGE"] = "Дякуємо, ваше повідомлення прийнято";
$MESS["MF_EMAIL_NOT_VALID"] = "Зазначений e-mail некоректний.";
$MESS["MF_CAPTCHA_WRONG"] = "Невірно вказано код захисту від автоматичних повідомлень.";
$MESS["MF_CAPTHCA_EMPTY"] = "Невірно вказано код захисту від автоматичних повідомлень.";
?>