<?
$MESS["START_FROM_TIP"] = "0 (значення за умовчанням) означає, що побудова навігаційного ланцюжка почнеться від кореня сайту. У разі, якщо заповнене поле <i>Шлях, для якого буде побудований навігаційний ланцюжок</i>, то номер пункту вважається в зазначеному шляху.";
$MESS["PATH_TIP"] = "В даному полі можна перевизначити шлях, для якого буде побудований навігаційний ланцюжок. Якщо поле не заповнене, то навігаційний ланцюжок буде будуватися для поточного шляху.";
$MESS["SITE_ID_TIP"] = "У списку перераховані всі сайти, створені в системі. Параметр встановлюється у випадку, якщо налаштована багатосайтовість і DOCUMENT_ROOT у сайтів різний.";
?>