<?
$MESS["IBCONV_FINALIZE"] = "Завершення переміщення значень властивостей елементів.";
$MESS["IBCONV_FINALIZE2"] = "Завершення переміщення значень властивостей елеметов і видалення таблиць, в яких вони зберігалися.";
$MESS["IBCONV_WARNING_MESSAGE"] = "Значення властивостей елементів інформаційного блоку #IBLOCK_NAME# будуть переміщені в інші таблиці.</p><p>Це може зайняти тривалий час. Якщо процес буде перерваний помилкою або завершиться з якої-небудь причини раніше, ніж буде закінчено, то необхідно буде запустити його ще раз.</p><p>Під час переміщення частина значень властивостей буде недоступна для показу і оновлення. Тому процес має бути завершений.</p><p>Для запуску переміщення натисніть кнопку «Перемістити».</p>";
$MESS["IBCONV_WRONG_VERSION"] = "Інформаційний блок невідомої версії.";
$MESS["IBCONV_WRONG_IBLOCK"] = "Інформаційного блоку не існує.";
$MESS["IBCONV_TITLE"] = "Конвертер властивостей ІБ";
$MESS["IBCONV_PERMISSION"] = "Недостатньо прав.";
$MESS["IBCONV_WRONG_CONVERSION"] = "Неприпустиме перетворення.";
$MESS["IBCONV_MOVE"] = "Перемістити";
$MESS["IBCONV_PROGRESS"] = "Переміщення значень властивостей елементів #DONE# з #TODO#.";
$MESS["IBCONV_INPROGRESS"] = "Переміщення значень властивостей елементів.";
$MESS["IBCONV_PREPARE"] = "Підготовка до переміщення значень властивостей.";
$MESS["IBCONV_FINISHED_HREF"] = "Повернутися до форми редагування інформаційного блоку.";
$MESS["IBCONV_TABLE_CREATION_ERROR"] = "Помилка створення таблиць для зберігання властивостей.";
$MESS["IBCONV_FINISHED"] = "Процес переміщення значень властивостей елементів інформаційного блоку завершений.";
$MESS["IBCONV_CREATE_TABLE"] = "Створення таблиць для зберігання значень властивостей.";
$MESS["IBCONV_ATTENTION"] = "Увага!";
$MESS["IBCONV_TOO_MANY_PROPERTIES"] = "Занадто багато властивостей (більше #NUM#). Перетворення неможливо.";
?>