<?
$MESS["MAIN_MAIL_CONFIRM_MESSAGE_HINT"] = "Для підтвердження email-адреси введіть даний код в вашому Бітрікс24.";
$MESS["MAIN_MAIL_CONFIRM_MESSAGE_FAQ_Q1"] = "Для чого потрібно підтверджувати email?";
$MESS["MAIN_MAIL_CONFIRM_MESSAGE_FAQ_A1"] = "Нам важливо перевірити адресу відправника, щоб виключити можливі помилки, а це значить, ваші клієнти відправлять відповідь на правильну адресу. Крім того, ми хочемо дати корисний інструмент чесному бізнесу та не підпускати шахраїв, які можуть підробити лист.";
?>