<?
$MESS["CHILD_MENU_TYPE_TIP"] = "Аналогічно з типом меню для першого рівня, визначається тип меню для інших рівнів.";
$MESS["MAX_LEVEL_TIP"] = "Приймає значення від 1 до 4. Тільки ті шаблони меню, які є багаторівневими, приймають значення, відмінні від 1.";
$MESS["ROOT_MENU_TYPE_TIP"] = "У випадаючому списку вибирається один із заданих у системі типів меню. Також можна вибрати пункт <i>інше</i>, тоді в поле поруч необхідно вказати інший тип меню латинськими літерами.";
$MESS["USE_EXT_TIP"] = "Якщо опція відзначена, то при виклику меню з шаблону у кожному розділі відбуватиметься перевірка на наявність у даному розділі файлу з ім'ям <i>.тип_меню.menu_ext.php</i>. У такому файлі визначається масив параметрів, який може бути виведений у якості пунктів меню зазначеного типу.";
?>