<?
$MESS["MAIN_CMEMBER_AUTH_TYPE"] = "Авторизація на контролері";
$MESS["MAIN_CMEMBER_ERR6"] = "Контролер повернув невалідний результат";
$MESS["MAIN_CMEMBER_ERR1"] = "Помилка авторизації на контролері";
$MESS["MAIN_CMEMBER_ERR4"] = "Помилка від'єднання від контролера";
$MESS["MAIN_CMEMBER_ERR2"] = "Помилка відправки повідомлення контролеру";
$MESS["MAIN_CMEMBER_ERR5"] = "Помилка з'єднання з сервером:";
$MESS["MAIN_CMEMBER_ERR3"] = "Помилка приєднання до контролера";
$MESS["MAIN_CMEMBER_ERR7"] = "Результат відповіді сервера має некоректний формат:";
?>