<?
$MESS["VULNSCAN_SIMILAR"] = "Аналогічно";
$MESS["VULNSCAN_REQUIRE"] = "Необхідні умови";
$MESS["VULNSCAN_FILE"] = "Файл";
$MESS["VULNSCAN_XSS_NAME"] = "Cross-Site Scripting";
$MESS["VULNSCAN_XSS_HELP"] = "Міжсайтова скриптинг (XSS) вразливість виникає тоді, коли дані, прийняті від користувача, виводяться в браузер без належної фільтрації. Уразливість може бути використана для зміни виду HTML сторінок уразливого сайту в контексті браузера цільового користувача, викрадення COOKIE даних браузера цільового користувача, з подальшим вторгненням в його сесію, під його обліковим записом.";
$MESS["VULNSCAN_XSS_HELP_SAFE"] = "Використовувати <b>htmlspecialcharsbx</b>. Параметри тегів з динамічними значеннями обмежувати подвійними лапками. Примусово додавати протокол (http), де це необхідно, для значень параметрів тегів, таких як href чи src.
";
$MESS["VULNSCAN_HEADER_NAME"] = "HTTP Response Splitting";
$MESS["VULNSCAN_HEADER_HELP"] = "Зловмисник, впроваджуючи довільний заголовок в HTTP відповідь, може виконати атаку з використанням перенаправлення або ж вставкою довільного HTML/JS коду. Рекомендується фільтрувати переклади рядків перед виведенням в заголовок відповіді. Актуально для PHP &lt;5.4.";
$MESS["VULNSCAN_HEADER_HELP_SAFE"] = "Рекомендується фільтрувати переклади рядків перед виведенням в заголовок відповіді.";
$MESS["VULNSCAN_DATABASE_NAME"] = "SQL Injection";
$MESS["VULNSCAN_DATABASE_HELP"] = "Класична вразливість, яка пов'язана з недостатньою фільтрацією даних, використаних в SQL запитах. Дана вразливість призводить до того, що нападаючий може виконати довільні SQL запити до бази даних. Наприклад, отримати значення довільних таблиць, змінити деякі значення (зробити себе адміном), видалити дані, і всю базу даних цілком.";
$MESS["VULNSCAN_DATABASE_HELP_SAFE"] = "Для числових даних, явно приводити значення до потрібного типу (int, float і т.п.), для строкових даних, обробляти дані за допомогою mysql_escape_string, \$ DB-> ForSQL () і т.п.. А також, контролювати довжину даних.";
$MESS["VULNSCAN_INCLUDE_NAME"] = "File Inclusion";
$MESS["VULNSCAN_INCLUDE_HELP"] = "Зловмисник може підключати локальні / видалені файли або ж читати довільні файли ресурсу. Рекомендується робити нормалізацію шляху в призначених для користувача даних перед їх використанням. Докладніше: <a href=\"https://rdot.org/forum/showthread.php?t=343\">https://rdot.org/forum/showthread.php?t=343 </a>";
$MESS["VULNSCAN_INCLUDE_HELP_SAFE"] = "Рекомендується як мінімум робити нормалізацію шляху перед їх використанням.";
$MESS["VULNSCAN_EXEC_NAME"] = "Виконання довільних команд";
$MESS["VULNSCAN_EXEC_HELP"] = "Уразливість пов'язана з недостатньою фільтрацією даних, що вставляється в аргумент функції <b>system</b> і т.п. Наприклад <b>system(\"ping \$_GET['host']\");</b> Нападаючий зможе виконати довільний код в системі.";
$MESS["VULNSCAN_EXEC_HELP_SAFE"] = "Проводити явну перевірку допустимості значення таких змінних з явно визначеної дозволеної множини значень. Наприклад, дозволяти тільки латинські букви і цифри, і т.п. Множину повинно бути задано виходячи з поставлених завдань. Також, можна використовувати функції типу escapeshellcmd і escapeshellarg.";
$MESS["VULNSCAN_CODE_NAME"] = "Виконання довільного коду";
$MESS["VULNSCAN_CODE_HELP"] = "Зловмисник може впровадити і виконати довільний PHP код.";
$MESS["VULNSCAN_CODE_HELP_SAFE"] = "Фільтрувати введення користувача, наприклад за допомогою <b>EscapePHPString</b>";
$MESS["VULNSCAN_POP_NAME"] = "Серіалізация даних";
$MESS["VULNSCAN_POP_HELP"] = "Десеріалізація даних користувача може бути досить небезпечна.";
$MESS["VULNSCAN_OTHER_NAME"] = "Потенційна зміна логіки роботи";
$MESS["VULNSCAN_OTHER_HELP"] = "Опис відсутній";
$MESS["VULNSCAN_UNKNOWN"] = "Підозра на вразливість";
$MESS["VULNSCAN_UNKNOWN_HELP"] = "Опис відсутній";
$MESS["VULNSCAN_HELP_INPUT"] = "Джерело";
$MESS["VULNSCAN_HELP_FUNCTION"] = "Функція/метод";
$MESS["VULNSCAN_HELP_VULNTYPE"] = "Тип уразливості";
$MESS["VULNSCAN_HELP_SAFE"] = "Як захищатися";
$MESS["VULNSCAN_FIULECHECKED"] = "Перевірено файлів:";
$MESS["VULNSCAN_VULNCOUNTS"] = "Знайдено потенційних проблем:";
$MESS["VULNSCAN_DYNAMIC_FUNCTION"] = "Виклик динамічної функції!";
$MESS["VULNSCAN_EXTRACT"] = "Раніше ініційовані змінні можуть бути перевизначені!";
$MESS["VULNSCAN_TOKENIZER_NOT_INSTALLED"] = "PHP розширення tokenizer не увімкнене, будь-ласка, увімкніть його для завершення тестування.
";
?>