<?
$MESS["BT_MOD_CAT_DSC_CONV_INVITE"] = "Увага! Сконвертуйте знижки на товари в новий формат. До конвертації знижки застосовуватися не будуть. Конвертор доступний за <a href=\"#LINK#\"> посиланню </a>";
$MESS["BT_MOD_CAT_DSC_CONV_ENTITY_IBLOCK_ERR"] = "Невірні або неіснуючі ID інфоблоків: #IDS#";
$MESS["BT_MOD_CAT_DSC_CONV_ENTITY_SECTION_ERR"] = "Невірні або неіснуючі ID розділів: #IDS#";
$MESS["BT_MOD_CAT_DSC_CONV_ENTITY_ELEMENT_ERR"] = "Невірні або неіснуючі ID товарів: #IDS#";
$MESS["BT_MOD_CAT_DSC_CONV_INACTIVE"] = "Знижка деактивована через наступних помилок:";
$MESS["BT_MOD_CAT_DSC_FORMAT_INVITE"] = "Увага! Проіндексуйте знижки на товари для покращення функціонування продукту. Індексація доступна за <a href=\"#LINK#\">посиланням</a>";
$MESS["BT_MOD_CAT_DSC_FORMAT_ERR"] = "Помилка індексації.";
$MESS["BT_MOD_CAT_DSC_FORMAT_INVITE_WITHOUT_MODULE"] = "Увага! Виявлені таблиці модуля Торговий каталог, але сам модуль деінстальован.  Якщо модуль буде знову встановлений, необхідно буде переіндексувати знижки на товари для поліпшення функціонування продукту. Індексація доступна по <a href=\"#LINK#\"> посиланням </a>";
?>