<?
$MESS["USER_PROPERTY_NAME_TIP"] = "Вкажіть назву закладки, на якій будуть відображені користувацькі властивості.";
$MESS["AJAX_MODE_TIP"] = "Включення для компоненту режиму AJAX.";
$MESS["USER_PROPERTY_TIP"] = "Позначте додаткові властивості, які необхідно відобразити у профілі користувача.";
$MESS["AJAX_OPTION_STYLE_TIP"] = "При AJAX-переходах будуть завантажені і оброблені списки стилів, викликаних компонентом.";
$MESS["AJAX_OPTION_SHADOW_TIP"] = "При виконанні переходу буде затінена область, яка повинна змінитися.";
$MESS["SET_TITLE_TIP"] = "При встановленій опції заголовком сторінки буде «Профіль користувача»";
$MESS["AJAX_OPTION_JUMP_TIP"] = "Прокручувати сторінку до початку компонента після AJAX-переходу";
$MESS["AJAX_OPTION_HISTORY_TIP"] = "Якщо опція увімкнена, кнопки браузера «Назад» і «Вперед» можуть використовуватися при AJAX-переходах.";
?>