<?
$MESS["main_app_pass_del"] = "Видалити";
$MESS["main_app_pass_title"] = "Що це?";
$MESS["main_app_pass_text1"] = "Для безпечної синхронізації ваших даних із зовнішніми програмами необхідно використовувати спеціальний пароль, який ви можете отримати на цій сторінці.";
$MESS["main_app_pass_text2"] = "У кожному із зазначених інструментів є список програм чи програм, з якими можна налаштувати синхронізацію (обмін даними). Натисніть по потрібному рядку і виберіть програму, з яким необхідно налаштувати обмін.";
$MESS["main_app_pass_created"] = "Створено";
$MESS["main_app_pass_last"] = "Останній вхід";
$MESS["main_app_pass_last_ip"] = "Останній IP";
$MESS["main_app_pass_manage"] = "Управління";
$MESS["main_app_pass_link"] = "З'єднати";
$MESS["main_app_pass_comment"] = "Коментар";
$MESS["main_app_pass_other"] = "інше";
$MESS["main_app_pass_comment_ph"] = "Додайте опис";
$MESS["main_app_pass_get_pass"] = "Отримати пароль";
$MESS["main_app_pass_create_pass"] = "Створити пароль";
$MESS["main_app_pass_create_pass_text"] = "Використовуйте цей пароль для синхронізації з обраним додатком.
За правилами безпеки пароль не може зберігатися у відкритому вигляді, тому він доступний тільки в момент його отримання.
Не блокуйте вікно, поки пароль НЕ буде скопійований або введений у відповідному полі.
";
$MESS["main_app_pass_create_pass_close"] = "Закрити";
$MESS["main_app_pass_del_pass"] = "Ви впевнені, що хочете видалити пароль?";
$MESS["main_app_pass_del_pass_text"] = "Синхронізація буде зупинена, оскільки програма не зможе отримати доступ до даних через помилку авторизації.";
$MESS["main_app_pass_cancel"] = "Скасувати";
?>