<?
$MESS["CMDESKTOP_TDEF_CONF_USER"] = "Ваші налаштування робочого столу будуть застосовуватися за умовчанням до всіх нових і не налаштованих раніше профілів користувачів. Продовжити?";
$MESS["CMDESKTOP_TDEF_CONF_GROUP"] = "Ваші налаштування робочого столу будуть застосовуватися за умовчанням до всіх нових і не налаштованих раніше робочих груп. Продовжити?";
$MESS["CMDESKTOP_TDEF_CONF"] = "Ваші налаштування робочого столу будуть застосовуватися за умовчанням до усіх нових або неавторизованих користувачів. Продовжити?";
$MESS["CMDESKTOP_TDEF_DELETE"] = "Видалити";
$MESS["CMDESKTOP_TDEF_ADD"] = "Додати";
$MESS["CMDESKTOP_TDEF_SET"] = "Зберегти як параметри за умовчанням";
$MESS["CMDESKTOP_TDEF_SETTINGS"] = "Налаштування";
$MESS["CMDESKTOP_TDEF_ERR2"] = "Помилка додавання гаджета на сервері.";
$MESS["CMDESKTOP_TDEF_ERR1"] = "Помилка збереження позиції гаджета на сервері.";
$MESS["CMDESKTOP_TDEF_HIDE"] = "Приховати";
$MESS["CMDESKTOP_TDEF_CANCEL"] = "Скасування";
$MESS["CMDESKTOP_TDEF_CLEAR"] = "Скинути поточні налаштування";
$MESS["CMDESKTOP_TDEF_CLEAR_CONF"] = "Для вашого робочого столу будуть застосовуватися стандартні параметри. Продовжити?";
?>