<?
$MESS["PAGE_PROP_DESCIPTION"] = "<b>Властивості сторінки</b> — визначають додаткові характеристики сторінки. Наприклад, значення властивості «Опис» використовується у мета-тегу <i>description</i>.";
$MESS["PAGE_PROP_TAGS_DESCIPTION"] = "Введіть через кому слова або фрази, які асоціюються з даною сторінкою. Вони використовуються для пошуку поточної сторінки.";
$MESS["PAGE_PROP_INHERIT_TITLE"] = "Властивість успадковується з вищого розділу. Для його зміни клікніть по полю.";
$MESS["PAGE_PROP_WINDOW_TITLE"] = "Властивості сторінки";
$MESS["PAGE_PROP_ACCESS_DENIED"] = "Доступ до редагування сторінки заборонено.";
$MESS["PAGE_PROP_NAME"] = "Заголовок";
$MESS["PAGE_PROP_FOLDER_NAME"] = "Заголовок сторінки";
$MESS["PAGE_PROP_FILE_NOT_FOUND"] = "Зазначеного файлу не існує.";
$MESS["PAGE_PROP_IN_ADMIN_SECTION"] = "Редагувати властивості папки у Панелі управління";
$MESS["PAGE_PROP_EDIT_IN_ADMIN"] = "Редагувати властивості сторінки у панелі управління";
$MESS["PAGE_PROP_TAGS"] = "Теги";
$MESS["PAGE_PROP_TAGS_NAME"] = "Теги сторінки";
?>