<?
$MESS["FOLDER_PROP_TITLE"] = "<b>Властивості розділу</b> — визначають додаткові характеристики розділу. Наприклад, значення властивості «Ключові слова» використовуються в якості ключових слів для всіх сторінок даного розділу (у мета-тегу keywords).";
$MESS["FOLDER_NAME_TITLE"] = "<b>Заголовок розділу</b> відображається в ланцюжку навігації («хлібних крихтах») в якості посилання на відповідний розділ.";
$MESS["FOLDER_EDIT_DELETE_PROP"] = "Видалити властивість";
$MESS["FOLDER_EDIT_PROP_TITLE"] = "Властивість успадковується з вищого розділу. Для його зміни клікніть по полю.";
$MESS["FOLDER_EDIT_WINDOW_TITLE"] = "Властивості розділу";
$MESS["FOLDER_EDIT_NEW_PROP"] = "Додати властивість";
$MESS["FOLDER_EDIT_ADD_PROPS"] = "Додаткові властивості";
$MESS["FOLDER_EDIT_ACCESS_DENIED"] = "Доступ до редагування розділу заборонений.";
$MESS["FOLDER_EDIT_NAME"] = "Заголовок";
$MESS["FOLDER_EDIT_FOLDER_NAME"] = "Заголовок розділу";
$MESS["FOLDER_EDIT_FILEMAN_ERROR"] = "Модуль «Управління структурою» не встановлено.";
$MESS["FOLDER_EDIT_IN_ADMIN_SECTION"] = "Редагувати властивості папки у Панелі управління";
?>